AchimPieters/ESP32-power-monitor-switch/main/main.c
// BL0942 -> HomeKit update interval
// How often we read the BL0942 and push values to HomeKit.
// Can be overridden via menuconfig (StudioPieters -> BL0942 Update Period).
#if defined(CONFIG_ESP_BL0942_UPDATE_PERIOD_MS)
#define BL0942_UPDATE_PERIOD_MS CONFIG_ESP_BL0942_UPDATE_PERIOD_MS
#else
#ifndef BL0942_UPDATE_PERIOD_MS
#define BL0942_UPDATE_PERIOD_MS 1000
#endif
#endif

// These characteristics are defined later in this file (Step 3).
// Energy meter characteristics are defined in this file and attached to the Outlet service.
// Use these names everywhere to avoid duplicate/copy issues with homekit_characteristic_t.
extern homekit_characteristic_t energy_voltage;
extern homekit_characteristic_t energy_current;
extern homekit_characteristic_t energy_power;
extern homekit_characteristic_t energy_energy;

static void bl0942_homekit_task(void *arg)
{
        (void)arg;

        // Init + start driver (single place; do NOT init in app_main as well)
        bl0942_config_t cfg = bl0942_config_default();
        calibration_load_from_nvs(&cfg);

        esp_err_t err = bl0942_init(&cfg);
        if (err != ESP_OK) {
                ESP_LOGE(BL0942_TAG, "bl0942_init failed: %s", esp_err_to_name(err));
                vTaskDelete(NULL);
                return;
        }

        err = bl0942_start();
        if (err != ESP_OK) {
                ESP_LOGE(BL0942_TAG, "bl0942_start failed: %s", esp_err_to_name(err));
                vTaskDelete(NULL);
                return;
        }

        // Restore cumulative energy base from NVS.
        (void)energy_load_from_nvs();

        // Persist total energy every 60s (mWh integer), so it survives reboots.
        TickType_t next_persist = xTaskGetTickCount() + pdMS_TO_TICKS(60000);

        ESP_LOGI(ENERGY_TAG, "BL0942 -> HomeKit task started (period=%d ms)", BL0942_UPDATE_PERIOD_MS);

        // --- Eve/Home polish ---
        // 1) Smooth noisy signals (EMA)
        // 2) Round to stable decimals (Eve graphs hate raw jitter)
        // 3) Rate-limit notifications (avoid HomeKit notify spam)
        // 4) Threshold updates (only meaningful changes)
        const float EMA_ALPHA_V = 0.20f;
        const float EMA_ALPHA_I = 0.20f;
        const float EMA_ALPHA_P = 0.20f;

        // Notify thresholds
        const float V_DELTA = 0.5f;     // V
        const float I_DELTA = 0.02f;    // A
        const float P_DELTA = 1.0f;     // W
        const float E_DELTA = 0.001f;   // kWh (1Wh)

        // Notify pacing
        const int64_t MIN_NOTIFY_US = 2LL * 1000LL * 1000LL; // 2 seconds

        float v_f = NAN, c_f = NAN, p_f = NAN;
        float last_v = NAN, last_c = NAN, last_p = NAN, last_e_kwh = NAN;
        int64_t last_v_notify_us = 0, last_c_notify_us = 0, last_p_notify_us = 0, last_e_notify_us = 0;


        while (true) {
                if (s_energy_reset_requested) {
                        s_energy_reset_requested = false;

                        // Reset smoothing + change detection so the next loop publishes fresh values.
                        v_f = c_f = p_f = NAN;
                        last_v = last_c = last_p = last_e_kwh = NAN;
                        last_v_notify_us = last_c_notify_us = last_p_notify_us = last_e_notify_us = 0;

                        // Publish a zero snapshot immediately (Home app feedback).
                        energy_voltage.value = HOMEKIT_FLOAT(0.0f);
                        homekit_characteristic_notify(&energy_voltage, energy_voltage.value);

                        energy_current.value = HOMEKIT_FLOAT(0.0f);
                        homekit_characteristic_notify(&energy_current, energy_current.value);

                        energy_power.value = HOMEKIT_FLOAT(0.0f);
                        homekit_characteristic_notify(&energy_power, energy_power.value);

                        energy_energy.value = HOMEKIT_FLOAT(0.0f);
                        homekit_characteristic_notify(&energy_energy, energy_energy.value);
                }

                const bl0942_measurements_t m = bl0942_get();

                if (!m.valid && relay_on) {
                        ESP_LOGW(BL0942_TAG, "BL0942 readings invalid (check UART wiring/SEL/SCLK_BPS/baud)");
                }

                float v = (m.valid ? m.voltage_v : 0.0f);
                float c = (m.valid ? m.current_a : 0.0f);
                float p = (m.valid ? m.power_w   : 0.0f);

                // Clamp and sanitize (Eve/Home dislikes NaN/inf/negative spikes)
                if (!isfinite(v) || v < 0.0f) v = 0.0f;
                if (!isfinite(c) || c < 0.0f) c = 0.0f;
                if (!isfinite(p) || p < 0.0f) p = 0.0f;

                // Smooth (EMA) only when we have valid signals
                if (isnan(v_f)) v_f = v; else v_f = v_f * (1.0f - EMA_ALPHA_V) + v * EMA_ALPHA_V;
                if (isnan(c_f)) c_f = c; else c_f = c_f * (1.0f - EMA_ALPHA_I) + c * EMA_ALPHA_I;
                if (isnan(p_f)) p_f = p; else p_f = p_f * (1.0f - EMA_ALPHA_P) + p * EMA_ALPHA_P;

                // Rounding/formatting (stable UI)
                const float v_out = roundf(v_f * 10.0f) / 10.0f;         // 0.1V
                const float c_out = roundf(c_f * 1000.0f) / 1000.0f;     // 0.001A
                const float p_out = roundf(p_f);                         // 1W

                // Total energy: base (NVS) + since-boot counter (from driver)
                const uint64_t e_since_boot_mwh = (uint64_t)((double)m.energy_wh * 1000.0);
                const uint64_t e_total_mwh = s_energy_mwh_base + e_since_boot_mwh;
                float e_total_kwh = (float)e_total_mwh / 1000000.0f;     // mWh -> kWh
                if (!isfinite(e_total_kwh) || e_total_kwh < 0.0f) e_total_kwh = 0.0f;
                e_total_kwh = roundf(e_total_kwh * 1000.0f) / 1000.0f;   // 0.001 kWh

                const int64_t now_us = esp_timer_get_time();

                // Update HomeKit characteristics only when meaningful AND rate-limited.
                if (isnan(last_v) || (fabsf(v_out - last_v) >= V_DELTA && (now_us - last_v_notify_us) >= MIN_NOTIFY_US)) {
                        last_v = v_out;
                        last_v_notify_us = now_us;
                        energy_voltage.value = HOMEKIT_FLOAT(v_out);
                        homekit_characteristic_notify(&energy_voltage, energy_voltage.value);
                }

                if (isnan(last_c) || (fabsf(c_out - last_c) >= I_DELTA && (now_us - last_c_notify_us) >= MIN_NOTIFY_US)) {
                        last_c = c_out;
                        last_c_notify_us = now_us;
                        energy_current.value = HOMEKIT_FLOAT(c_out);
                        homekit_characteristic_notify(&energy_current, energy_current.value);
                }

                if (isnan(last_p) || (fabsf(p_out - last_p) >= P_DELTA && (now_us - last_p_notify_us) >= MIN_NOTIFY_US)) {
                        last_p = p_out;
                        last_p_notify_us = now_us;
                        energy_power.value = HOMEKIT_FLOAT(p_out);
                        homekit_characteristic_notify(&energy_power, energy_power.value);
                }

