AchimPieters/ESP32-power-monitor-switch/main/main.c
                if (isnan(last_e_kwh) || (fabsf(e_total_kwh - last_e_kwh) >= E_DELTA && (now_us - last_e_notify_us) >= MIN_NOTIFY_US)) {
                        last_e_kwh = e_total_kwh;
                        last_e_notify_us = now_us;
                        energy_energy.value = HOMEKIT_FLOAT(e_total_kwh);
                        homekit_characteristic_notify(&energy_energy, energy_energy.value);
                }

                // Persist cumulative energy periodically so it survives a reboot.
                if (xTaskGetTickCount() >= next_persist) {
                        next_persist = xTaskGetTickCount() + pdMS_TO_TICKS(60000);
                        // Save the current total. Do NOT change s_energy_mwh_base during runtime;
                        // it is the "energy at boot" base. This avoids double counting.
                        (void)energy_save_to_nvs(e_total_mwh);
                }

                vTaskDelay(pdMS_TO_TICKS(BL0942_UPDATE_PERIOD_MS));
        }
}

// ---------- Low-level GPIO helpers ----------

static inline void relay_write(bool on) {
        gpio_set_level(RELAY_GPIO, on ? 1 : 0);
}

static inline void blue_led_write(bool on) {
        // AUBESS power monitor switch: blue LED is active-low.
        // We want LED ON when relay is ON.
        gpio_set_level(BLUE_LED_GPIO, on ? 0 : 1);
}

// 3x korte blauwe LED blink (zonder de relay status te veranderen)
static void blink_blue_led_3x(void) {
        bool previous_led_state = relay_on;

        for (int i = 0; i < 3; i++) {
                blue_led_write(true);
                vTaskDelay(pdMS_TO_TICKS(100));
                blue_led_write(false);
                vTaskDelay(pdMS_TO_TICKS(100));
        }

        // Restore normal behavior (LED follows relay state)
        blue_led_write(previous_led_state);
}

// Forward declaration van de characteristic zodat we hem in functies kunnen gebruiken
extern homekit_characteristic_t relay_on_characteristic;

// Centrale functie: zet state, stuurt hardware aan en (optioneel) HomeKit-notify
static void relay_set_state(bool on, bool notify_homekit) {
        if (relay_on == on) {
                // Geen verandering, niets te doen
                return;
        }

        relay_on = on;

        // Hardware aansturen
        relay_write(relay_on);
        blue_led_write(relay_on); // Blauwe LED volgt altijd de relay-status

        ESP_LOGI(RELAY_TAG, "Relay state -> %s", relay_on ? "ON" : "OFF");

        // HomeKit characteristic-snapshot updaten
        relay_on_characteristic.value = HOMEKIT_BOOL(relay_on);

        // Eventueel HomeKit-clients informeren
        if (notify_homekit) {
                homekit_characteristic_notify(&relay_on_characteristic,
                                              relay_on_characteristic.value);
        }
}

// All GPIO Settings
void gpio_init(void) {
        // Relay
        gpio_reset_pin(RELAY_GPIO);
        gpio_set_direction(RELAY_GPIO, GPIO_MODE_OUTPUT);

        // Blauwe LED (aan/uit)
        gpio_reset_pin(BLUE_LED_GPIO);
        gpio_set_direction(BLUE_LED_GPIO, GPIO_MODE_OUTPUT);

        // Switch input (optioneel)
        gpio_reset_pin(SWITCH_GPIO);
        gpio_set_direction(SWITCH_GPIO, GPIO_MODE_INPUT);
        gpio_set_pull_mode(SWITCH_GPIO, GPIO_PULLUP_ONLY);

        // Button input (active-low)
        gpio_reset_pin(BUTTON_GPIO);
        gpio_set_direction(BUTTON_GPIO, GPIO_MODE_INPUT);
        gpio_set_pull_mode(BUTTON_GPIO, GPIO_PULLUP_ONLY);

        // Initial state: alles uit, in sync brengen
        relay_on = false;
        relay_on_characteristic.value = HOMEKIT_BOOL(false);
        relay_write(false);
        blue_led_write(false);

        // Bij start is er nog geen WiFi -> status LED in WiFi-wachtstand
}

// ---------- Accessory identification (Blue LED) ----------

void accessory_identify_task(void *args) {
        // Blink BLUE LED to identify, then restore previous state
        bool previous_led_state = relay_on; // LED volgt normaal relay_on

        for (int i = 0; i < 3; i++) {
                for (int j = 0; j < 2; j++) {
                        blue_led_write(true);
                        vTaskDelay(pdMS_TO_TICKS(100));
                        blue_led_write(false);
                        vTaskDelay(pdMS_TO_TICKS(100));
                }
                vTaskDelay(pdMS_TO_TICKS(250));
        }

        // Zet LED terug naar de normale toestand (afhankelijk van relay_on)
        blue_led_write(previous_led_state);

        vTaskDelete(NULL);
}

void accessory_identify(homekit_value_t _value) {
        ESP_LOGI(IDENT_TAG, "Accessory identify");
        xTaskCreate(accessory_identify_task, "Accessory identify", configMINIMAL_STACK_SIZE,
                    NULL, 2, NULL);
}

// ---------- HomeKit characteristics ----------

#define DEVICE_NAME          "HomeKit Switch"
#define DEVICE_MANUFACTURER  "StudioPieters®"
#define DEVICE_SERIAL        "NLSP2AUB571A"
#define DEVICE_MODEL         "SW702NL/A"
#define FW_VERSION           "0.0.1"

homekit_characteristic_t name = HOMEKIT_CHARACTERISTIC_(NAME, DEVICE_NAME);
homekit_characteristic_t manufacturer = HOMEKIT_CHARACTERISTIC_(MANUFACTURER, DEVICE_MANUFACTURER);
homekit_characteristic_t serial = HOMEKIT_CHARACTERISTIC_(SERIAL_NUMBER, DEVICE_SERIAL);
homekit_characteristic_t model = HOMEKIT_CHARACTERISTIC_(MODEL, DEVICE_MODEL);
homekit_characteristic_t revision = HOMEKIT_CHARACTERISTIC_(FIRMWARE_REVISION, LIFECYCLE_DEFAULT_FW_VERSION);
homekit_characteristic_t ota_trigger = API_OTA_TRIGGER;

// Getter: HomeKit vraagt huidige toestand op
homekit_value_t relay_on_get() {
        return HOMEKIT_BOOL(relay_on);
}

// Setter: aangeroepen door HomeKit (Home-app / Siri / automations)
void relay_on_set(homekit_value_t value) {
        if (value.format != homekit_format_bool) {
                ESP_LOGE(RELAY_TAG, "Invalid value format: %d", value.format);
                return;
        }

        bool new_state = value.bool_value;

        // Via centrale functie, maar ZONDER notify (originator is HomeKit zelf)
        relay_set_state(new_state, false);
}

