AchimPieters/ESP32-power-monitor-switch/main/main.c
// We keep a handle to ON characteristic so we can notify on button presses
homekit_characteristic_t relay_on_characteristic =
        HOMEKIT_CHARACTERISTIC_(ON, false, .getter = relay_on_get, .setter = relay_on_set);

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Woverride-init"
homekit_accessory_t *accessories[] = {
        HOMEKIT_ACCESSORY(
                .id = 1,
                .category = homekit_accessory_category_switches, // Smart plug / outlet
                .services = (homekit_service_t *[]) {
                HOMEKIT_SERVICE(ACCESSORY_INFORMATION, .characteristics = (homekit_characteristic_t *[]) {
                        &name,
                        &manufacturer,
                        &serial,
                        &model,
                        &revision,
                        HOMEKIT_CHARACTERISTIC(IDENTIFY, accessory_identify),
                        NULL
                }),
                HOMEKIT_SERVICE(SWITCH, .primary = true, .characteristics = (homekit_characteristic_t *[]) {
                        HOMEKIT_CHARACTERISTIC(NAME, "HomeKit Switch"),
                        &relay_on_characteristic,
                        &ota_trigger,
                        &energy_voltage,
                        &energy_current,
                        &energy_power,
                        &energy_energy,
                        NULL
                }),
                NULL
        }),
        NULL
};
#pragma GCC diagnostic pop

homekit_server_config_t config = {
        .accessories = accessories,
        .password = CONFIG_ESP_SETUP_CODE,
        .setupId = CONFIG_ESP_SETUP_ID,
};

// ---------- Button handling ----------

void button_callback(button_event_t event, void *context) {
        switch (event) {
        case button_event_single_press: {
                ESP_LOGI(BUTTON_TAG, "Single press -> toggle relay");

                bool new_state = !relay_on;

                // 1) Zelfde logica als HomeKit, maar nu MET notify
                relay_set_state(new_state, true);

                break;
        }
        case button_event_double_press:
                // Reset cumulative energy without wiping the whole device.
                ESP_LOGI(BUTTON_TAG, "Double press -> reset energy total");
                s_energy_mwh_base = 0;
                (void)energy_save_to_nvs(0);

                // Reset BL0942's internal accumulator. The periodic measurement task
                // will push the updated (0.0) energy value to HomeKit on the next tick.
                bl0942_reset_energy();
                s_energy_reset_requested = true;

                // Visual confirmation for the user (same idea as Identify)
                blink_blue_led_3x();
                break;
        case button_event_long_press:
                ESP_LOGI(BUTTON_TAG, "Long press (10s) -> factory reset + reboot");
                lifecycle_factory_reset_and_reboot();
                break;
        default:
                ESP_LOGI(BUTTON_TAG, "Unknown button event: %d", event);
                break;
        }
}

// ---------- Wall switch handling (S1/S2) ----------
// AUBESS: wall switch input is typically a dry contact to GND -> active-low.
static void wall_switch_task(void *arg) {
        (void)arg;

        int last = gpio_get_level(SWITCH_GPIO);
        int stable = last;
        TickType_t last_change = xTaskGetTickCount();

        while (1) {
                int now = gpio_get_level(SWITCH_GPIO);

                if (now != last) {
                        last = now;
                        last_change = xTaskGetTickCount();
                }

                // debounce ~50ms
                if ((xTaskGetTickCount() - last_change) > pdMS_TO_TICKS(50)) {
                        if (stable != last) {
                                stable = last;
                                // IMPORTANT:
                                // Treat the wall switch as a *toggle* input.
                                // Any physical change (edge) toggles the relay, regardless of
                                // HomeKit state or the absolute switch position.
                                bool new_state = !relay_on;
                                ESP_LOGI("SWITCH", "Wall switch edge -> toggle relay to %s", new_state ? "ON" : "OFF");
                                relay_set_state(new_state, true);
                        }
                }

                vTaskDelay(pdMS_TO_TICKS(10));
        }
}

// ---------- Wi-Fi / HomeKit startup ----------

void on_wifi_ready() {
        static bool homekit_started = false;

        if (homekit_started) {
                ESP_LOGI("INFORMATION", "HomeKit server already running; skipping re-initialization");
                return;
        }

        ESP_LOGI("INFORMATION", "Starting HomeKit server...");
        homekit_server_init(&config);
        homekit_started = true;
}

// ---------- app_main ----------

void app_main(void) {
        ESP_ERROR_CHECK(lifecycle_nvs_init());
        lifecycle_log_post_reset_state("INFORMATION");
        ESP_ERROR_CHECK(lifecycle_configure_homekit(&revision, &ota_trigger, "INFORMATION"));

        gpio_init();

        // Start wall switch monitoring (debounced). This keeps physical switch in sync with HomeKit.
        xTaskCreate(wall_switch_task, "wall_switch", 2048, NULL, 4, NULL);

#if CONFIG_BL0942_ENABLE
        // Start the BL0942 measurement + HomeKit publisher task
        xTaskCreate(bl0942_homekit_task, "bl0942_hk", 4096, NULL, 5, NULL);
#else
        ESP_LOGI(BL0942_TAG, "BL0942 disabled in sdkconfig (CONFIG_BL0942_ENABLE=n)");
#endif

        button_config_t btn_cfg = button_config_default(button_active_low);
        btn_cfg.max_repeat_presses = 3;
        btn_cfg.long_press_time = 10000; // 10 seconds for lifecycle_factory_reset_and_reboot

        if (button_create(BUTTON_GPIO, btn_cfg, button_callback, NULL)) {
                ESP_LOGE(BUTTON_TAG, "Failed to initialize button");
        }

        esp_err_t wifi_err = wifi_start(on_wifi_ready);
        if (wifi_err == ESP_ERR_NVS_NOT_FOUND) {
                ESP_LOGW("WIFI", "WiFi configuration not found; provisioning required");
                // Geen geldige WiFi-config -> status LED WiFi-wachtstand
        } else if (wifi_err != ESP_OK) {
                ESP_LOGE("WIFI", "Failed to start WiFi: %s", esp_err_to_name(wifi_err));
                // Fout bij starten WiFi -> status LED WiFi-wachtstand
        }
}
